Tekla Open API Reference for Tekla Structures 2025
ViewShorteningAttributes Constructor
Overload List
Name | Description
View.ViewShorteningAttributes()
 Creates a new default view shortening attributes instance.
View.ViewShorteningAttributes(Boolean, Boolean, Double, Double, View.ShorteningCutPartType)
 Creates a new view shortening attributes instance with the given parameters.
Top
See Also
Reference
View.ViewShorteningAttributes Class
Tekla.Structures.Drawing Namespace